--Insert values

INSERT INTO Statuses (StatusName) VALUES 
('חדש'), ('בטיפול'), ('בבדיקה'), ('הושלם'), ('בוטל');

INSERT INTO Categories (CategoryName) VALUES 
('עבודה'), ('לימודים'), ('אישי'), ('תחזוקת בית'), ('פרויקט גמר');

INSERT INTO Tasks (Title, Description, StatusId, CategoryId, CreatedAt) VALUES 
('הקמת DB', 'יצירת טבלאות וקשרים ב-SQL Server', 4, 5, '2025-01-01'),
('כתיבת פרוצדורות', 'לפחות 5 פרוצדורות לפי הדרישות', 2, 5, '2025-01-02'),
('התקנת Angular', 'הקמת פרויקט צד לקוח חדש', 4, 2, '2025-01-03'),
('בניית API', 'יצירת Controller שישמש כצינור', 1, 5, GETDATE()),
('עיצוב מסך רשימה', 'שימוש ב-HTML ו-CSS בסיסי', 1, 2, GETDATE()),
('קניית לפטופ חדש', 'לבדוק דגמים שמתאימים לפיתוח', 3, 3, GETDATE()),
('ניקוי מיילים', 'לעבור על תיבת הדואר הנכנס', 4, 1, '2025-01-05'),
('פגישת צוות', 'דיון על התקדמות הפרקטיקום', 2, 1, GETDATE()),
('קניות לשבת', 'פירות, ירקות ומוצרי חלב', 1, 4, GETDATE()),
('אימון כושר', 'הליכה של 40 דקות', 4, 3, '2025-01-08'),
('תיקון באגים ב-API', 'בדיקת החיבור ל-SQL', 1, 5, GETDATE()),
('לימוד Reactive Forms', 'הבנה איך לבנות טפסים באנגולר', 2, 2, GETDATE()),
('סידור חדר עבודה', 'ארגון הניירת על השולחן', 3, 4, GETDATE()),
('שליחת דוח שבועי', 'עדכון המנחה בהתקדמות', 1, 1, GETDATE()),
('גיבוי קוד לגיטהאב', 'העלאת גרסה ראשונה של הפרויקט', 1, 5, GETDATE());


select * from Tasks
select * from Statuses
select * from Categories